In [1]:
# OUTER MERGE

In [14]:
import numpy as np
import pandas as pd

registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [5]:
# The outer command is an easy way to merge all the columns, regardless of the missing data.

pd.merge(registrations,logins, how = 'outer' , on = 'name')

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [15]:
# JOIN INDEX INSTEAD OF A COLUMN.

registrations = registrations.set_index('name')
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [17]:
pd.merge(registrations, logins, left_index = True, right_on = 'name', how = 'inner')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4    Bobo

In [18]:
registrations = registrations.reset_index()

In [19]:
registrations

     name  reg_id
0  Andrew       1
1    Bobo       2
2  Claire       3
3   David       4

In [22]:
registrations.columns = ['reg_name', 'reg_id']

In [23]:
registrations

  reg_name  reg_id
0   Andrew       1
1     Bobo       2
2   Claire       3
3    David       4

In [24]:
pd.merge(registrations, logins, how = 'inner', left_on ='reg_name', right_on = 'name')

  reg_name  reg_id  log_id    name
0   Andrew       1       2  Andrew
1     Bobo       2       4    Bobo

In [25]:
# To drop a duplicated column we can easily

results = pd.merge(registrations, logins, how = 'inner', left_on ='reg_name', right_on = 'name')
results.drop('reg_name', axis = 1)

   reg_id  log_id    name
0       1       2  Andrew
1       2       4    Bobo

In [26]:
registrations.columns = ['name', 'id']

In [27]:
logins.columns = ['id', 'name']

In [28]:
registrations

     name  id
0  Andrew   1
1    Bobo   2
2  Claire   3
3   David   4

In [29]:
logins

   id     name
0   1   Xavier
1   2   Andrew
2   3  Yolanda
3   4     Bobo

In [31]:
pd.merge(registrations, logins, how = 'inner', on = 'name', suffixes = ('_reg','_log'))

     name  id_reg  id_log
0  Andrew       1       2
1    Bobo       2       4